
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СкладОтправитель = СкладПолучатель Тогда
		Сообщить("Проведение документа невозможно, склад отправитель не может совпадать со складом получателя.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество,
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", СкладОтправитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
			
			Если ТекСтрокаНоменклатура.Наименование = ВыборкаДетальныеЗаписи.Номенклатура Тогда
				Если ТекСтрокаНоменклатура.Количество > ВыборкаДетальныеЗаписи.Количество Тогда
					Отказ = Истина;				
					Сообщить("Не хватает материалов на складе " + СкладОтправитель + " по позициям " + ВыборкаДетальныеЗаписи.Номенклатура  + " в количестве "  + (ТекСтрокаНоменклатура.Количество - ВыборкаДетальныеЗаписи.Количество));
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.Записывать = Истина;
	
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		
		// регистр ОстаткиМатериалов Расход
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Наименование;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
		
		// регистр ОстаткиМатериалов Приход
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНоменклатура.Наименование;
		Движение.Склад = СкладПолучатель;
		Движение.Количество = ТекСтрокаНоменклатура.Количество;
	КонецЦикла;
	
	Движения.Записать();
		
КонецПроцедуры
