Процедура ТабличнаяЧастьНеЗаполнена() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПриПустойТабличнойЧасти",ОповещениеОбОшибках.ЭтотОбъект);
	ТекстВопроса = "СписокСотрудников пустой, выдача заработной платы невозможна";
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОК);
	
КонецПроцедуры

Процедура ПриПустойТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Сообщить("Заполните табличную часть!");
	
КонецПроцедуры

Процедура ТабличнаяЧастьЗаполенаНеПолностью () Экспорт
	
	
	
КонецПроцедуры


