Процедура ТабличнаяЧастьНеЗаполнена() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПриПустойТабличнойЧасти",ОповещениеОбОшибках.ЭтотОбъект);
	ТекстВопроса = "СписокСотрудников пустой, выдача заработной платы невозможна";
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОК);
	
КонецПроцедуры

Процедура ПриПустойТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Сообщить("Заполните табличную часть!");
	
КонецПроцедуры

Процедура ТабличнаяЧастьЗаполенаНеПолностью () Экспорт
	
	
	
КонецПроцедуры

Процедура ТабличнаяЧастьУжеЗаполнена () Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПриЗаполненнойТабличнойЧасти",ОповещениеОбОшибках.ЭтотОбъект);
	ТекстВопроса = "СписокСотрудников уже заполнен всеми сотрудниками, повторное заполнение, или дополнение не требуется";
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОК);
	
	
КонецПроцедуры

Процедура ПриЗаполненнойТабличнойЧасти (Результат, ДополнительныеПараметры)  Экспорт
	
	
	
КонецПроцедуры

Процедура ИмеютсяКоллизииВТабличнойЧасти () Экспорт
	
	Оповещение = Новый ОписаниеОповещения("КоллизииВТабличнойЧасти",ОповещениеОбОшибках.ЭтотОбъект);
	ТекстВопроса = "В Табличной части документа имеются повторяющиеся записи, запись невозможна";
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОК);
	
КонецПроцедуры

Процедура КоллизииВТабличнойЧасти (Результат, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

Процедура НеЗаполненоПолеВвода () Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПустоеПолеВвода",ОповещениеОбОшибках.ЭтотОбъект);
	ТекстВопроса = "Поле суммы не заполнено";
	ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ОК);
	
КонецПроцедуры

Процедура ПустоеПолеВвода (Результат, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

