
Процедура КандидатаУстроилаДолжностьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	   Результат = Истина;
	
КонецПроцедуры

Процедура ОсталисьЕщеДолжностиДляКандидатаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	   Результат = Истина;
	
КонецПроцедуры

Процедура КандидатСправилсяПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Результат = Истина;

КонецПроцедуры

Процедура КандидатСправилсяСТехническимЗаданиемПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Результат = Истина;

КонецПроцедуры
