
&НаСервере
Процедура ЗаполнитьНаОснованииЗаключенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу.Ссылка КАК Ссылка,
	|	ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу.НомерСтроки КАК НомерСтроки,
	|	ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу.Номенклатура КАК Номенклатура,
	|	ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаключениеОТК.ТоварыНеПрошедшиеЭкспертизу КАК ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу
	|ГДЕ
	|	ЗаключениеОТКТоварыНеПрошедшиеЭкспертизу.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЗаключениеОТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.НоменклатураСДефектами.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОснованииЗаключения(Команда)
	ЗаполнитьНаОснованииЗаключенияНаСервере();
КонецПроцедуры
