
&НаКлиенте
Процедура ЦехПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСменуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаРабочейСменыСотрудникиСмены.Ссылка КАК Ссылка,
	|	УстановкаРабочейСменыСотрудникиСмены.НомерСтроки КАК НомерСтроки,
	|	УстановкаРабочейСменыСотрудникиСмены.ФИО КАК ФИО,
	|	УстановкаРабочейСменыСотрудникиСмены.Должность КАК Должность
	|ИЗ
	|	Документ.УстановкаРабочейСмены.СотрудникиСмены КАК УстановкаРабочейСменыСотрудникиСмены
	|ГДЕ
	|	УстановкаРабочейСменыСотрудникиСмены.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		НоваяСтрока = Объект.СотрудникиСмены.Добавить();
		НоваяСтрока.ФИО = ВыборкаДетальныеЗаписи.ФИО;
		НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Должность;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСмену(Команда)
	
	ТЧСотрудники = Объект.СотрудникиСмены; 
	// проверка на двойную запись одного и того же сотрудника
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(ТЧСотрудники) = Истина Тогда
		ОповещениеОбОшибках.ИмеютсяКоллизииВТабличнойЧасти();
		Возврат;
	КонецЕсли;
	
	// банальная проверка, чтобы случайно не записать не те данные
	Если Объект.СотрудникиСмены.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЦехПолон1",ЭтаФорма.ЭтотОбъект);
		ТекстВопроса = "В таблице уже имеются записи о сотрудниках, провести запись с удалением прыдыдущих ?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		ЗаполнитьСменуНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦехПолон1 (Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СотрудникиСмены.Очистить();
		ЗаполнитьСменуНаСервере();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьСменуНаСервере();
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры;

