Функция  ОпределитьКоличествоСотрудников() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоСотрудников = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоСотрудников = КоличествоСотрудников + 1;
	КонецЦикла;
	
	Возврат КоличествоСотрудников;	
	
КонецФункции

Процедура ЗаполнитьСписокСотрудниковНаСервере (ТабличнаяЧасть,СсылкаНаФорму) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияСотрудников.Сотрудник КАК ФИО,
	|	НачисленияСотрудников.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.НачисленияСотрудников КАК НачисленияСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для Каждого ТекущаяСтрока ИЗ ТабличнаяЧасть Цикл
			Если ТекущаяСтрока.ФИО = ВыборкаДетальныеЗаписи.ФИО Тогда
				Флаг = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ Флаг = Истина Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			СсылкаНаФорму.ОбновитьОтображениеДанных ();
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры

