Функция  ОпределитьКоличествоСотрудников() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Представление КАК Представление
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоСотрудников = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоСотрудников = КоличествоСотрудников + 1;
	КонецЦикла;

Возврат КоличествоСотрудников;	
	
КонецФункции
