
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСоСправочниками.ОтпускнаяЦена(Объект.Дата,СтрокаТЧ.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТЧ);	
	
КонецПроцедуры

&НаСервере
Процедура ПродажиНаСервере()
	
		
КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	ПродажиНаСервере();
КонецПроцедуры
