
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстДок = Новый ТекстовыйДокумент;
	ПечатьНаСервере(ТекстДок,ПараметрКоманды);
	ТекстДок.Показать("ЧекККМ");
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТекстДок,СсылкаНаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Номер КАК Номер,
	|	РеализацияТоваровИУслуг.Дата КАК Дата,
	|	РеализацияТоваровИУслуг.Контрагент.Представление КАК Контрагент,
	|	РеализацияТоваровИУслуг.ДокументИтог КАК Итого,
	|	РеализацияТоваровИУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Ссылка = &СсылкаНаДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровИУслугТовары.Номенклатура.Представление КАК Товар,
	|	РеализацияТоваровИУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровИУслугТовары.Цена КАК Цена
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	|ГДЕ
	|	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатШапка = РезультатЗапроса[0];
	РезультатТаблица = РезультатЗапроса[1];
	
	ВыборкаШапка = РезультатШапка.Выбрать();
	ВыборкаШапка.Следующий();
	
	ВыборкаТовары = РезультатТаблица.Выбрать();
	
	Макет = Документы.РеализацияТоваровИУслуг.ПолучитьМакет("ЧекККМ");
	
	
	//   ОБЛАСТЬ ДЛЯ ШАПКИ
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Контрагент = ВыборкаШапка.Контрагент;
	ОбластьШапка.Параметры.Номер = ВыборкаШапка.Номер;
	ОбластьШапка.Параметры.Дата = ВыборкаШапка.Дата;
	ТекстДок.Вывести(ОбластьШапка);
	
	
	// ОБЛАСТЬ ДЛЯ ТАБЛИЦЫ
	ОбластьТаблицы = Макет.ПолучитьОбласть("Таблицы");
	
	Пока ВыборкаТовары.Следующий() Цикл
		
		ОбластьТаблицы.Параметры.НаименованиеТовара = ВыборкаТовары.Товар;
		ОбластьТаблицы.Параметры.Количество = Формат(ВыборкаТовары.Количество,"ЧДЦ=3");
		ОбластьТаблицы.Параметры.Цена = Формат(ВыборкаТовары.Цена,"ЧДЦ=2");
		ТекстДок.Вывести(ОбластьТаблицы);
		
	КонецЦикла; 		
	
	
	// ОБЛАСТЬ ИТОГОВ
	ОбластьИтог = Макет.ПолучитьОбласть("Итогов");
	
	ОбластьИтог.Параметры.СуммаИтог = Формат(ВыборкаШапка.Итого,"ЧДЦ=2");
	ОбластьИтог.Параметры.ТипОплаты = ВыборкаШапка.Проведен;
	ТекстДок.Вывести(ОбластьИтог);
	
КонецПроцедуры 

