//Функция ОстатокПоСчету(Счет, Период)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РегистрБухУчетОстатки.СуммаОстатокДт,
//		|	РегистрБухУчетОстатки.СуммаОстатокКт
//		|ИЗ
//		|	РегистрБухгалтерии.РегистрБухУчет.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухУчетОстатки";

//	Запрос.УстановитьПараметр("Период", Период);
//	Запрос.УстановитьПараметр("Счет", Счет);

//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат 0;
//	КонецЕсли;

//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

//	ВыборкаДетальныеЗаписи.Следующий();
//	
//	Если Счет.Вид = ВидСчета.Активный Тогда
//		Возврат ВыборкаДетальныеЗаписи.СуммаОстатокДт;
//	Иначе
//		Возврат ВыборкаДетальныеЗаписи.СуммаОстатокКт;
//	КонецЕсли;
//	
//КонецФункции

//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	КонецПериода = КонецМесяца(Дата)+1;
//	
//	ОстатокВыручка = ОстатокПоСчету(ПланыСчетов.Основной.Касса, КонецПериода);
//	ОстатокСебестоимость = ОстатокПоСчету(ПланыСчетов.Основной.себе , КонецПериода);
//	
//	Движения.РегистрБухУчет.Записывать = Истина;
//	
//	Проводка = Движения.РегистрБухУчет.Добавить();
//	Проводка.Период = Дата;
//	Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Выручка;
//	Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
//	Проводка.Сумма = ОстатокВыручка;
//	
//	Проводка = Движения.РегистрБухУчет.Добавить();
//	Проводка.Период = Дата;
//	Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Прибыль;
//	Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Себестоимость;
//	Проводка.Сумма = ОстатокСебестоимость;
//	
//	
//КонецПроцедуры
