Функция ОстатокПоСчету(Счет, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрБухУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	РегистрБухУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Расчетный.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухУчетОстатки";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Счет", Счет);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	
	Если Счет.Вид = ВидСчета.Активный Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстатокДт;
	Иначе
		Возврат ВыборкаДетальныеЗаписи.СуммаОстатокКт;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	КонецПериода = КонецМесяца(Дата)+1;
	
	ОстатокВыручка = ОстатокПоСчету(ПланыСчетов.Основной.Касса, КонецПериода);
	ОстатокСебестоимость = ОстатокПоСчету(ПланыСчетов.Основной.Продажи , КонецПериода);
	
	Движения.Расчетный.Записывать = Истина;
	
	Проводка = Движения.Расчетный.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.Продажи;
	Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Проводка.Сумма = ОстатокВыручка;
	
	Проводка = Движения.Расчетный.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Проводка.СчетКт = ПланыСчетов.Основной.Продажи;
	Проводка.Сумма = ОстатокСебестоимость;
		
КонецПроцедуры
