
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаНоменклатураСДефектами Из НоменклатураСДефектами Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Справочники.Номенклатура.МикропроцессорБрак;
		Движение.Склад = Справочники.Склады.ОТК;
		Движение.Количество = ТекСтрокаНоменклатураСДефектами.Количество;
	КонецЦикла;
	
КонецПроцедуры
