
Процедура ПриЗаписи(Отказ)
	
	ДокументИтог = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РасходыНаПоставкуСырья 
	Движения.РасходыНаПоставкуСырья.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.РасходыНаПоставкуСырья.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;
	
	// регистр бухгалтерии Расчетный                              
	Движения.Расчетный.Записывать = Истина;
	
	Проводка = Движения.Расчетный.Добавить();
	Проводка.Период = Дата;	
	Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСПоставщикамиИПодрядчиками;
	Проводка.СчетКт = ПланыСчетов.Основной.РасчетныеСчета;
	Проводка.Сумма = ДокументИтог;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДокументИтог = Товары.Итог("Сумма");
КонецПроцедуры
