
&НаСервере
Функция СотрудникиСменыФИОПриИзмененииНаСервере(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Должность;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСменыФИОПриИзменении(Элемент)
	Сотрудник = Элементы.СотрудникиСмены.ТекущиеДанные;
	Сотрудник.Должность = СотрудникиСменыФИОПриИзмененииНаСервере(Сотрудник.ФИО);
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",
	ПараметрыФормы, Элементы.СотрудникиСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСменыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		НоваяСтрока = Объект.СотрудникиСмены.Добавить();
		НоваяСтрока.ФИО = ВыбранныйЭлемент;
	КонецЦикла;
	
КонецПроцедуры
