Перем Флаг;
Перем КоличествоСотрудников;

&НаКлиенте
Процедура ЗаполнитьСписокСотрудников(Команда)
	ЗаполнитьСписокСотрудниковНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокСотрудниковНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияСотрудников.Сотрудник КАК ФИО,
	|	НачисленияСотрудников.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.НачисленияСотрудников КАК НачисленияСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЧСписокСотрудников = Объект.СписокСотрудников;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для Каждого ТекущаяСтрока ИЗ ТЧСписокСотрудников Цикл
			Если ТекущаяСтрока.ФИО = ВыборкаДетальныеЗаписи.ФИО Тогда
				Флаг = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ Флаг = Истина Тогда
			НоваяСтрока = Объект.СписокСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		КонецЕсли;
		
	КонецЦикла;                                          	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	Элементы.СписокСотрудников.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьПолнуюСуммуЗаработнойЛпаты(Команда)
	
	КоличествоСотрудников = РаботаСДокументамиНаСервере.ОпределитьКоличествоСотрудников();
	
	Если Объект.СписокСотрудников.Количество() = 0 Тогда	
		Сообщить("Список сотрудников пуст");
		Возврат;
	ИначеЕсли КоличествоСотрудников <>  Объект.СписокСотрудников.Количество() Тогда
		
		Оповещение = Новый  ОписаниеОповещения ("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Заполнены не все сотрудники предприятия, дополнить таблицу автоматически?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	ВыплатитьПолнуюСуммуЗаработнойЛпатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыплатитьПолнуюСуммуЗаработнойЛпатыНаСервере()
	
	НаборЗаписей = РегистрыНакопления.ДолгиПоЗаработнойПлатеСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	
	ТЧСписокСотрудников = Объект.СписокСотрудников;
	Для Каждого СтрокаТЧ ИЗ ТЧСписокСотрудников Цикл
		
		Запись = НаборЗаписей.ДобавитьРасход();
		Запись.Регистратор = Объект.Ссылка;
		Запись.Сотрудник = СтрокаТЧ.ФИО;
		Запись.Сумма = СтрокаТЧ.Сумма;
		
	КонецЦикла;
	
	//НаборЗаписей.Записать(ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопрос (Результат, ДополнительныеПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Сообщить("пизда");
		
		ТЧСотрудники = Объект.СписокСотрудников;
		АвтоматическоеДополнениеТаблицыСотрудниковНаСервере(ТЧСотрудники);			
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АвтоматическоеДополнениеТаблицыСотрудниковНаСервере(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для Каждого СтрокаТЧ Из Список Цикл
			
			Если СтрокаТЧ.ФИО <> ВыборкаДетальныеЗаписи.Сотрудник Тогда
				
				Сообщить("Заглушка, застрял,");
				
				КонецЕсли;
			
			КонецЦикла;
		
		
	КонецЦикла;
	
КонецПроцедуры
