Перем Флаг;
Перем КоличествоСотрудников;

&НаКлиенте
Процедура ЗаполнитьСписокСотрудников(Команда)
	ЗаполнитьСписокСотрудниковНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокСотрудниковНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияСотрудников.Сотрудник КАК ФИО,
	|	НачисленияСотрудников.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.НачисленияСотрудников КАК НачисленияСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЧСписокСотрудников = Объект.СписокСотрудников;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Для Каждого ТекущаяСтрока ИЗ ТЧСписокСотрудников Цикл
			Если ТекущаяСтрока.ФИО = ВыборкаДетальныеЗаписи.ФИО Тогда
				Флаг = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ Флаг = Истина Тогда
			НоваяСтрока = Объект.СписокСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		КонецЕсли;
		
	КонецЦикла;                                          	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	Элементы.СписокСотрудников.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьПолнуюСуммуЗаработнойЛпаты(Команда)
	
	КоличествоСотрудников = РаботаСДокументамиНаСервере.ОпределитьКоличествоСотрудников();
	
	Если Объект.СписокСотрудников.Количество() = 0 Тогда	
		Сообщить("Список сотрудников пуст");
		Возврат;
	ИначеЕсли КоличествоСотрудников <>  Объект.СписокСотрудников.Количество() Тогда
		
		Оповещение = Новый  ОписаниеОповещения ("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Заполнены не все сотрудники предприятия, дополнить таблицу автоматически?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе
		АвтоматическоеДополнениеКолонкиЗарплатыНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопрос (Результат, ДополнительныеПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда	
		ТЧСотрудники = Объект.СписокСотрудников;
		АвтоматическоеДополнениеТаблицыСотрудниковНаСервере(ТЧСотрудники);
		АвтоматическоеДополнениеКолонкиЗарплатыНаСервере();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеДополнениеТаблицыСотрудниковНаСервере(Список)
	Список.Очистить();
	ЗаполнитьСписокСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтоматическоеДополнениеКолонкиЗарплатыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолгиПоЗаработнойПлатеСотрудникамОстатки.Сотрудник КАК Сотрудник,
	|	ДолгиПоЗаработнойПлатеСотрудникамОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДолгиПоЗаработнойПлатеСотрудникам.Остатки(, ) КАК ДолгиПоЗаработнойПлатеСотрудникамОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЧСписокСотрудников = Объект.СписокСотрудников;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		Для Каждого ТекСтрока ИЗ ТЧСписокСотрудников Цикл
			
			Если ТекСтрока.ФИО = ВыборкаДетальныеЗаписи.Сотрудник Тогда	
				ТекСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатитьПоловинуЗарплаты(Команда)
	
	ВыплатитьПоловину = Истина;
	КоличествоСотрудников = РаботаСДокументамиНаСервере.ОпределитьКоличествоСотрудников();
	
	Если Объект.СписокСотрудников.Количество() = 0 Тогда	
		Сообщить("Список сотрудников пуст");
		Возврат;
	ИначеЕсли КоличествоСотрудников <>  Объект.СписокСотрудников.Количество() Тогда
		
		Оповещение = Новый  ОписаниеОповещения ("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Заполнены не все сотрудники предприятия, дополнить таблицу автоматически?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

