
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокГотовойНоменклатуры Из СписокГотовойНоменклатуры Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокГотовойНоменклатуры.Номенклатура;
		Движение.Склад = Справочники.Склады.Основной;
		Движение.Количество = ТекСтрокаСписокГотовойНоменклатуры.Количество;
	КонецЦикла;
	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокОтгружаемойНоменклатуры Из СписокОтгружаемойНоменклатуры Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокОтгружаемойНоменклатуры.Номенклатура;
		Движение.Склад = Справочники.Склады.Основной;
		Движение.Количество = ТекСтрокаСписокОтгружаемойНоменклатуры.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(, ) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.Склад = &Склад
	|	И ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.Основной);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Отказ = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Передача невозможна, не хватает позиций по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " на складе " + ВыборкаДетальныеЗаписи.Склад + " в количестве " + ВыборкаДетальныеЗаписи.КоличествоОстаток);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
