
Процедура Печать(ТабДок, Ссылка) Экспорт
	
		Макет = Документы.ТоварнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварнаяНакладная.Дата КАК Дата,
	|	ТоварнаяНакладная.Номер КАК Номер,
	|	ТоварнаяНакладная.Принял КАК Принял,
	|	ТоварнаяНакладная.СписокНоменклатуры.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК Наименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК СписокНоменклатуры,
	|	ТоварнаяНакладная.Контрагент КАК Контрагент,
	|	ТоварнаяНакладная.Принял.Должность.Представление КАК ПринялДолжностьПредставление
	|ИЗ
	|	Документ.ТоварнаяНакладная КАК ТоварнаяНакладная
	|ГДЕ
	|	ТоварнаяНакладная.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокНоменклатурыШапка = Макет.ПолучитьОбласть("СписокНоменклатурыШапка");
	ОбластьСписокНоменклатуры = Макет.ПолучитьОбласть("СписокНоменклатуры");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// установить параметры области заголовка
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// заполнить параметры шапки документа
		Шапка.Параметры.НаименованиеОрганизации = Константы.НазваниеОрганизации.Получить();
		Шапка.Параметры.Контрагент = Выборка.Контрагент;
		Шапка.Параметры.Заполнить(Выборка)	;
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьСписокНоменклатурыШапка);
		ВыборкаСписокНоменклатуры = Выборка.СписокНоменклатуры.Выбрать();
		Пока ВыборкаСписокНоменклатуры.Следующий() Цикл
			ОбластьСписокНоменклатуры.Параметры.Заполнить(ВыборкаСписокНоменклатуры);
			ТабДок.Вывести(ОбластьСписокНоменклатуры, ВыборкаСписокНоменклатуры.Уровень());
		КонецЦикла;

		// Заполнение подвала
		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.Должность = Выборка.ПринялДолжностьПредставление;
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
