

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорНаПоставкуКомплектующих") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Принял = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = СписокНоменклатуры.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Наименование = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварнаяНакладнаяСписокНоменклатуры.Наименование КАК Наименование,
	|	СУММА(ТоварнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(ТоварнаяНакладнаяСписокНоменклатуры.Цена) КАК Цена,
	|	СУММА(ТоварнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ТоварнаяНакладная.СписокНоменклатуры КАК ТоварнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	ТоварнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварнаяНакладнаяСписокНоменклатуры.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СебестоимостьНоменклатуры.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		  // регистр ОстаткиМатериалов Приход
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Наименование;
		Движение.Склад = Склад;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
		// регистр СебестоимостьНоменклатуры Приход
		Движение = Движения.СебестоимостьНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Наименование;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
		
	//  регистр бухгалтерии Расчетный
	Движения.Расчетный.Записывать = Истина;
	Движение = Движения.Расчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.Товары;
	Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщикамиИПодрядчиками;
	Движение.Период = Дата;
	Движение.Сумма = ДокументИтог;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ДокументИтог =  СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
