
&НаКлиенте
Процедура СписокНоменклатурыНаименованиеПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	// установка значения для цены
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ОтпускнаяЦена(Объект.Дата,СтрокаТабличнойЧасти.Наименование);
	
	// так как цена поменялась, сразу пересчитаем суммы
	РаботаСДокументами.РассчетСуммы(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТабличнойЧасти);
	
КонецПроцедуры
