
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЧСотрудники = ITСпециаласты;
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(ТЧСотрудники) = Истина Тогда
		Сообщить("в табличной части Сотрудники смены имеются повторяющиеся записи. Проведение невозможно");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр БракПроизводства Приход
	Для Каждого ТекСтрокаБрак ИЗ ТоварыНеПрошедшиеЭкспертизу Цикл
		Движение = Движения.БракПроизводства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаБрак.Номенклатура;
		Движение.Количество = ТекСтрокаБрак.Количество;
		Движение.Склад = Справочники.Склады.СкладБрака;
	КонецЦикла;
	
	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаРеализованнаяПродукция Из РеализованнаяПродукция Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		Движение.Склад = Отдел;
		Движение.Количество = ТекСтрокаРеализованнаяПродукция.Количество;
	КонецЦикла;
	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраченныеМатериалы Из ЗатраченныеМатериалы Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура;
		Движение.Склад = Отдел;
		Движение.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
	КонецЦикла;
	
	
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Склад = &Склад) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Отдел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Проведение невозможно, не хватает позиций по номенклатуре: " + ВыборкаДетальныеЗаписи.Номенклатура + " в количистве " + ВыборкаДетальныеЗаписи.Количество );
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
