
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель КАК СотрудникРодитель
	|ИЗ
	|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серсия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серсия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(Отбор)
	
	ДиаграммаГанта.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель КАК СотрудникРодитель
	|ИЗ
	|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ЗаработнаяПлатаФактическийПериодДействия.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель",Отбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серсия = ДиаграммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серсия);
		Интервал = Значение.Добавить();
		
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Отбор = Отчет.ОтборПоОтделу;
	
	Если НЕ ЗначениеЗаполнено(Отбор) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаСервере(Отбор);
КонецПроцедуры



