
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаработнаяПлата
	Движения.ЗаработнаяПлата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ЗаработнаяПлата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ВидРасчета;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = ТекСтрокаСписокСотрудников.БазаНачало;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаСписокСотрудников.БазаКонец);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.ФИО;
		Движение.ДанныеДляРасчета = ТекСтрокаСписокСотрудников.Процент;
	КонецЦикла;
	
	
КонецПроцедуры


//Премия = ВыборкаДетальныеЗаписи.СуммаБаза * ВыборкаДетальныеЗаписи.ДанныеДляРасчета / 100;
