// переменные для записи себестоимости
Перем РеализованныйПродкут;
Перем КоличествоПродукции;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЧСотрудники = СотрудникиСмены;
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(ТЧСотрудники) = Истина Тогда
		Сообщить("в табличной части Сотрудники смены имеются повторяющиеся записи. Проведение невозможно");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаРеализованнаяПродукция Из РеализованнаяПродукция Цикл
		// регистр ОстаткиМатериалов Приход
		Движения.ОстаткиМатериалов.Записывать = Истина;
		
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаРеализованнаяПродукция.Количество;
		
		РеализованныйПродкут = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		КоличествоПродукции = ТекСтрокаРеализованнаяПродукция.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СебестоимостьНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	СебестоимостьНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	СебестоимостьНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СебестоимостьНоменклатуры.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ПроизводствоЗаСменуЗатраченныеМатериалы.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.ПроизводствоЗаСмену.ЗатраченныеМатериалы КАК ПроизводствоЗаСменуЗатраченныеМатериалы
	|				ГДЕ
	|					ПроизводствоЗаСменуЗатраченныеМатериалы.Ссылка = &Ссылка)) КАК СебестоимостьНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивОстатков = Запрос.Выполнить().Выгрузить();
	
	ОбщаяСебестоимостьИзготовления = 0;
	
	Для Каждого ТекСтрокаЗатраченныеМатериалы Из ЗатраченныеМатериалы Цикл
		
		// регистр ОстаткиМатериалов Расход
		Движения.ОстаткиМатериалов.Записывать = Истина;
		
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
		
		// расчет себестоимости производства одной единицы продукции.
		Для Каждого СтрокаТЧ ИЗ МассивОстатков Цикл
			Если СтрокаТЧ.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура Тогда 
				СебестоимостьИзготовленияЕдиницыПродукта = СтрокаТЧ.СуммаОстаток/СтрокаТЧ.КоличествоОстаток;
			КонецЕсли;
		КонецЦикла;
		
		СебестоимостьИзготовленияПоОдномуМатериалу = СебестоимостьИзготовленияЕдиницыПродукта * ТекСтрокаЗатраченныеМатериалы.Количество;
		ОбщаяСебестоимостьИзготовления = ОбщаяСебестоимостьИзготовления + СебестоимостьИзготовленияПоОдномуМатериалу;		
		
	КонецЦикла;
	
	// регистр СебестоимостьНоменклатуры Приход
	Движения.СебестоимостьНоменклатуры.Записывать = Истина;
	
	Движение = Движения.СебестоимостьНоменклатуры.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = РеализованныйПродкут;
	Движение.Количество = КоличествоПродукции;
	Движение.Сумма = ОбщаяСебестоимостьИзготовления;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Склад = &Склад) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Цех);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Проведение невозможно, не хватает позиций по номенклатуре: " + ВыборкаДетальныеЗаписи.Номенклатура + " в количистве " + ВыборкаДетальныеЗаписи.Количество );
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
