
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиМатериалов Приход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаРеализованнаяПродукция Из РеализованнаяПродукция Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаРеализованнаяПродукция.Количество;
	КонецЦикла;

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраченныеМатериалы Из ЗатраченныеМатериалы Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
	КонецЦикла;

КонецПроцедуры
