
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(СписокСотрудников) Тогда
		Сообщить("Проведение невозможно, так как в таблице имеются повторные записи!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр ДолгиПоЗаработнойПлатеСотрудникам Расход
	Движения.ДолгиПоЗаработнойПлатеСотрудникам.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ДолгиПоЗаработнойПлатеСотрудникам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.ФИО;
		Движение.Сумма = ТекСтрокаСписокСотрудников.Сумма;
	КонецЦикла;
	
КонецПроцедуры
