
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СписокСотрудников.Количество() = 0 Тогда	
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Табличная часть не заполнена, проведение невозможно!'; en = 'The table part is not filled in, it is not possible to conduct'"));
	КонецЕсли;
	
	// регистр ДолгиПоЗаработнойПлатеСотрудникам Расход
	Движения.ДолгиПоЗаработнойПлатеСотрудникам.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ДолгиПоЗаработнойПлатеСотрудникам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.ФИО;
		Движение.Сумма = ТекСтрокаСписокСотрудников.Сумма;
	КонецЦикла;
	
КонецПроцедуры
